# вычислить периметр прямоугольника
a= int ( input ("a="))
b= int ( input ("b="))
p1=2*a+2*b
p1str = "периметр прямоугольника = " + str(p1)
print (p1str)

# Пользователь вводит число и степень. Программа вычисляет указанную степень этого числа
a= int ( input ("a="))
stepen= int ( input ("введите степень возведения числа "))
b=a**stepen
print (b)